{"_id":{"$oid":"6169904da1a11032f348eb31"},"Title":"Schindler’s List","Description":"The true story of Czech born Oskar Schindler, a businessman who tried to make his fortune during the Second World War by exploiting cheap Jewish labour, but ended up penniless having saved over 1000 Polish Jews from almost certain death during the Holocaust.","Genre":{"Name":"drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters"},"Director":{"Name":"Steven Spielberg","Bio":"Steven Spielberg, in full Steven Allan Spielberg, born in Ohio is an American motion-picture director and producer whose diverse films—which ranged from science-fiction fare, including such classics as Close Encounters of the Third Kind (1977) and E.T.: The Extra-Terrestrial (1982), to historical dramas, notably Schindler’s List (1993) and Saving Private Ryan (1998)—enjoyed both unprecedented popularity and critical success.","Birth":"1971-03-26"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNDE4OTMxMTctNmRhYy00NWE2LTg3YzItYTk3M2UwOTU5Njg4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_FMjpg_UX1000_.jpg","Featured":true}
{"_id":{"$oid":"6169aa80a1a11032f348eb32"},"Title":"The Lord of the Rings: The Fellowship of the Ring","Description":"The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed it in the hands of a young Hobbit named Frodo Baggins, who inherits the Ring and steps into legend. A daunting task lies ahead for Frodo when he becomes the Ringbearer, to destroy the One Ring in the fires of Mount Doom where it was forged","Genre":{"Name":"fantasy","Description":"Fantasy is a genre of literature that features magical and supernatural elements that do not exist in the real world. Although some writers juxtapose a real-world setting with fantastical elements, many create entirely imaginary universes with their own physical laws and logic and populations of imaginary races and creatures. Speculative in nature, fantasy is not tied to reality or scientific fact."},"Director":{"Name":"Peter Jackson","Bio":"Born in New Zealand, Peter Jackson started his prolific career as a child, creating short films with a 8-mm movie camera. Without any formal training, Jackson has directed a number of successful films ranging across all genres. He is most well-known for his film adaptation of J.R.R. Tolkien's Lord of the Rings trilogy, which has won numerous awards. He stayed with the Tolkien fantasy brand when The Hobbit film series was released.","Birth":"1961-10-31"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg","Featured":false}
{"_id":{"$oid":"6169aae2a1a11032f348eb33"},"Title":"The Shining","Description":"The Shining is a story about the lives of a family in which the husband works as a caretaker in a hotel overlooking Colorado, named the Overlook Hotel, and much to the husband and wife’s unknowing, the hotel has a force within it that transcends the eras and would like to spread further terror to the ones inside it, and the one to notice, and experience it firsthand is the family’s son, Danny Torrance.","Genre":{"Name":"thriller","Description":"Thriller is a genre of fiction, having numerous, often overlapping subgenres. Thrillers are characterized and defined by the moods they elicit, giving viewers heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"Director":{"Name":"Stanley Kubrick","Bio":"Born in New York City, Stanley Kubrick worked as a photographer for Look magazine before exploring filmmaking in the 1950s. He went on to direct a number of acclaimed films, including Spartacus (1960), Lolita (1962), Dr. Strangelove (1964), A Clockwork Orange (1971), 2001: A Space Odyssey (1968), The Shining (1980), Full Metal Jacket (1987) and Eyes Wide Shut (1999).","Birth":"1928-07-26","Death":"1999-03-07"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BZWFlYmY2MGEtZjVkYS00YzU4LTg0YjQtYzY1ZGE3NTA5NGQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169ab20a1a11032f348eb34"},"Title":"Inception","Description":"Dom Cobb is a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.","Genre":{"Name":"sciencefiction","Description":"Science fiction (sometimes shortened to sci-fi or SF) is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan, (born in London, England), British film director and writer acclaimed for his noirish visual aesthetic and unconventional, often highly conceptual narratives. Nolan was raised by an American mother and a British father, and his family spent time in both Chicago and London.","Birth":"1970-07-30"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169ab3ea1a11032f348eb35"},"Title":"Django Unchained","Description":"Two years before the Civil War, Django, a slave, finds himself accompanying an unorthodox German bounty hunter named Dr. King Schultz on a mission to capture the vicious Brittle brothers. Their mission successful, Schultz frees Django, and together they hunt the South''s most-wanted criminals. Their travels take them to the infamous plantation of shady Calvin Candie, where Django''s long-lost wife is still a slave.","Genre":{"Name":"action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Tarantino, in full Quentin Jerome Tarantino, born in Knoxville, Tennessee, U.S., is an American director and screenwriter whose films are noted for their stylized violence, razor-sharp dialogue, and fascination with film and pop culture.","Birth":"1963-03-27"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169ab57a1a11032f348eb36"},"Title":"The Truman Show","Description":"He doesn't know it, but everything in Truman Burbank's life is part of a massive TV set. Executive producer Christof orchestrates The Truman Show, a live broadcast of Truman's every move captured by hidden cameras. Cristof tries to control Truman's mind, even removing his true love, Sylvia, from the show and replacing her with Meryl. As Truman gradually discovers the truth, however, he must decide whether to act on it.","Genre":{"Name":"comedy","Description":"Comedy is generally defined as a literary work that is written to amuse or entertain a reader. In a comedy, characters can certainly suffer misfortune, but they are typically comedic situations with positive outcomes. Not all examples of comedy as a literary device are funny."},"Director":{"Name":"Peter Weir","Bio":"Peter Weir, in full Peter Lindsay Weir, (born in Sydney, Australia), Australian film director and screenwriter known for intelligent emotional dramas that frequently explore the relationship between characters and their social environment. He contributed to a renaissance in Australian filmmaking and directed a string of acclaimed Hollywood movies.","Birth":"1944-08-21"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMDIzODcyY2EtMmY2MC00ZWVlLTgwMzAtMjQwOWUyNmJjNTYyXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169ab7ba1a11032f348eb37"},"Title":"Mamma Mia!","Description":"Donna, an independent hotelier in the Greek islands, is preparing for her daughter''s wedding with the help of two old friends. Meanwhile Sophie, the spirited bride, has a plan. She secretly invites three men from her mother''s past in hope of meeting her real father and having him escort her down the aisle on her big day.","Genre":{"Name":"comedy","Description":"Comedy is generally defined as a literary work that is written to amuse or entertain a reader. In a comedy, characters can certainly suffer misfortune, but they are typically comedic situations with positive outcomes. Not all examples of comedy as a literary device are funny."},"Director":{"Name":"Phyllida Lloyd","Bio":"Phyllida Christian Lloyd, is an English film director and producer, best known for Mamma Mia! (2008) and The Iron Lady (2011). Her theatre work includes directing productions at the Royal Court Theatre and Royal National Theatre, and opera director for Opera North and the Royal Opera House Covent Garden.","Birth":"1957-06-17"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTA2MDU0MjM0MzReQTJeQWpwZ15BbWU3MDYwNzgwNzE@._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169ab8da1a11032f348eb38"},"Title":"The Green Mile","Description":"Paul Edgecomb walked the mile with a variety of cons. He had never encountered someone like John Coffey, a massive black man convicted of brutally killing a pair of young sisters. Coffey had the size and strength to kill anyone, but not the demeanor. Beyond his simple, naive nature and a deathly fear of the dark, Coffey seemed to possess a prodigious, supernatural gift. Paul began to question whether Coffey was truly guilty of murdering the two girls.","Genre":{"Name":"drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters"},"Director":{"Name":"Frank Darabont","Bio":"Three-time Oscar nominee Frank Darabont was born in a refugee camp in 1959 in Montbeliard, France, the son of Hungarian parents who had fled Budapest during the failed 1956 Hungarian revolution. Brought to America as an infant, he settled with his family in Los Angeles and attended Hollywood High School.","Birth":"1959-01-28"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTUxMzQyNjA5MF5BMl5BanBnXkFtZTYwOTU2NTY3._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169ababa1a11032f348eb39"},"Title":"The Hunger Games","Description":"Changed movie description","Genre":{"Name":"action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Francis Lawrence","Bio":"Changed director bio","Birth":"1971-03-26"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMjA4NDg3NzYxMF5BMl5BanBnXkFtZTcwNTgyNzkyNw@@._V1_FMjpg_UX1000_.jpg","Featured":false}
{"_id":{"$oid":"6169abbea1a11032f348eb3a"},"Title":"I am Legend","Description":"Robert Neville, a brilliant scientist, is a survivor of a man-made plague that transforms humans into bloodthirsty mutants. He wanders alone through New York City, calling out for other possible survivors, and works on finding a cure for the plague using his own immune blood. Neville knows he is badly outnumbered and the odds are against him, and all the while, the infected wait for him to make a mistake that will deliver Neville into their hands.","Genre":{"Name":"action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Francis Lawrence","Bio":"Francis Lawrence is an Austrian-born American filmmaker and producer. After establishing himself as a director of music videos and commercials, Lawrence made his feature-length directorial debut with the supernatural thriller Constantine (2005) and has since directed the postapocalyptic horror film I Am Legend (2007), the romantic drama Water for Elephants (2011), three of the four films in the Hunger Games film series, and the spy thriller Red Sparrow (2018).","Birth":"1971-03-26"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYTE1ZTBlYzgtNmMyNS00ZTQ2LWE4NjEtZjUxNDJkNTg2MzlhXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_FMjpg_UX1000_.jpg","Featured":false}
